Attribute VB_Name = "P_1__“екущийќтчЄт"
Option Explicit
'
' ћодуль содержит параметры текущего отчЄта.
' “ак же отвечает за Q-параметры
'
Global ѕоставщик As Variant, —чЄтчик”зел As Variant
Global —чЄтчикћодель As Variant, —чЄтчикЌомер As Variant

Global Ўаблон“ип As Variant, ќтчЄтЌазвание As Variant
Global “ипјрхива As Variant, “ипѕериода As Variant
Global ƒеньѕ As Variant, ƒень—трого As Boolean
Global ќтчЄтћаска As Variant
' Global ЌеЅолее As Variant

Global ѕлановый As Boolean
Global ƒень’ As Variant, ќтчЄт«а As Variant
Global ќтчЄтƒата As Variant, ќтчЄт¬рем€ As Variant
Global ќтчЄтќт As Variant, ќтчЄтƒо As Variant
Global ќтчЄт‘айл As Variant, Datime As Variant

Global ѕрервать„тение As Boolean


'   *************************
'   *** —брос, считывание ***
'   *************************
Public Sub —броситьѕараметры_I()
    Ўаблон“ип = ""
    ќтчЄтЌазвание = ""
    ќтчЄтћаска = ""
    “ипјрхива = Null
    “ипѕериода = Null
    ƒеньѕ = Null
    ƒень—трого = True
'    ЌеЅолее = Null
End Sub

Public Sub —броситьѕараметры_P()
    ѕоставщик = ""
    —чЄтчик”зел = ""
    —чЄтчикћодель = ""
    —чЄтчикЌомер = ""
End Sub

Public Sub —броситьѕараметры_R()
    ќтчЄт‘айл = ""
    ƒень’ = Null
    ѕлановый = True
    ќтчЄтƒата = Date
    ќтчЄт¬рем€ = Time()
    ќтчЄт«а = Null
    ќтчЄтќт = Null
    ќтчЄтƒо = Null
End Sub

Public Sub —броситьѕараметры_¬се()
    —броситьѕараметры_I
    —броситьѕараметры_P
    —броситьѕараметры_R
End Sub

Public Sub ¬з€тьѕараметры_I(ByVal Ўаблон As Variant)
    —броситьѕараметры_I
        If NoData(Ўаблон) Then Exit Sub
    „итать»Ќ‘ќ Ўаблон
' „итает I-параметры (»Ќ‘ќ)
    Ўаблон“ип = ¬з€ть»Ќ‘ќ(»Ќ‘ќ_“ип)
    “ипјрхива = ¬з€ть»Ќ‘ќ(»Ќ‘ќ_“ипјрхива)
    “ипѕериода = ¬з€ть»Ќ‘ќ(»Ќ‘ќ_“ипѕериода)
    ƒеньѕ = —читатьƒень(¬з€ть»Ќ‘ќ(»Ќ‘ќ_ƒеньѕ), “ипѕериода)
    ќтчЄтЌазвание = ¬з€ть»Ќ‘ќ(»Ќ‘ќ_»м€ќтчЄта)
    ќтчЄтћаска = ¬з€ть»Ќ‘ќ(»Ќ‘ќ_ћаска)
End Sub

Public Sub ¬з€тьѕараметры_P(ByVal ѕрофиль As Variant)
    —броситьѕараметры_P
        If NoData(ѕрофиль) Then Exit Sub
    ќткрытьѕрофиль ѕрофиль
' „итает P-параметры (»Ќ‘ќ)
    —чЄтчик”зел = „итатьѕараметр_P(”зел_ћнемо)
    —чЄтчикћодель = „итатьѕараметр_P(”зел_ћодель)
    —чЄтчикЌомер = „итатьѕараметр_P(”зел_Ќомер)
    «акрытьѕрофиль
End Sub


'   *********************************
'   *** јвтоматическое назначение ***
'   *********************************
' “ут -- алгоритмы назначени€ периода и границ по умолчанию
'
Public Sub ѕоправитьƒни’иѕ()
    If NoData(ƒень’) Or (ƒень’ = 0) Then ƒень’ = 101
    If NoData(ƒеньѕ) Or (ƒеньѕ = 0) Then
        ƒеньѕ = ƒеньѕо—чЄтчику(ƒень’, “ипѕериода)
      End If
End Sub

Public Function ѕериодјвто()
' ¬ычисл€ет текущий период
    If NoData(“ипѕериода) Or “ипѕериода = 0 Then
        ѕериодјвто = Null
      Else
        ѕериодјвто = ѕредыдущийѕериод(ѕериодѕоƒате(Date, “ипѕериода, ƒеньѕ))
      End If
End Function

Public Function ¬ерхн€€јвто(ByVal ѕериод As Variant)
' ¬ычисл€ет верхнюю метку отчЄта
Dim d As Variant, Q As Variant
    ¬ерхн€€јвто = Null
        If NoData(“ипјрхива) Or (“ипјрхива = 0) Then Exit Function
    d = ћетка«аписиѕоƒате(Date, ƒень’, “ипјрхива)
    If Not NoData(ѕериод) Then
        Q = ѕланова€ƒата(ѕериод, ƒеньѕ)
        Q = ћетка«аписиѕоƒате(Q, ƒень’, “ипјрхива)
        If Q < d Then d = Q
      End If
    ¬ерхн€€јвто = d
End Function

Public Function Ќижн€€јвто(ByVal ѕериод As Variant)
Dim d As Variant, X As Integer, P As Integer
    Ќижн€€јвто = Null
        If NoData(“ипјрхива) Or (“ипјрхива = 0) Then Exit Function
    ' “ут надо подготовить период дл€ ј¬“ќ.
    If NoData(ѕериод) Then
        d = ћетка«аписиѕоƒате(Date, ƒень’, “ипјрхива)
        d = ћеткаЌазад(d, ƒлинаќтчЄта(“ипѕериода, “ипјрхива))
      Else
        d = ѕредыдущийѕериод(ѕериод)
        d = ѕланова€ƒата(d, ƒеньѕ)
        d = ћетка«аписиѕоƒате(d, ƒень’, “ипјрхива)
      End If
    Ќижн€€јвто = —ледующа€ћетка(d, “ипјрхива)
End Function


